DataProcessors/ВыгрузкаСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаСправочников</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеЮридическоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРеистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕДРПОУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Признак</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыОплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Контакты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мобильный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДоставки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАктуальный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Домашний</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакМобильный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ВыгрузкаСправочников/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Фильтр                      = НСтр("ru='Файл csv(*.csv)|*.csv|Файл excel(*.xls; *.xlsx)|*.xls; *.xlsx'");
	ДиалогВыбораФайла.Заголовок                   = НСтр("ru='Выберите csv файл|Выберите xlsx файл'");
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = "csv";  //?
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла              = ПутьКФайлу;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		ПутьКФайлу = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВыгрузитьНаСервере(НазваниеСправочника,ПутьКФайлу)
	ApplicationExcel = Новый COMОбъект("Excel.Application");
	ApplicationExcel.Visible = Истина; // Запущен в фоновом режиме = Ложь, "Видемый" режим = Истина
	ApplicationExcel.Workbooks.Open(ПутьКФайлу);
		
	Если НазваниеСправочника = "Номенклатура" Тогда
		Выборка = Справочники.Номенклатура.Выбрать();
		ApplicationExcel.Sheets(1).Cells(1,1).Value = "Код";
		ApplicationExcel.Sheets(1).Cells(1,2).Value = "Наименование";
		ApplicationExcel.Sheets(1).Cells(1,3).Value = "ВидТовара";
		b = 1;
		c = 2;
		d = 3;
	ИначеЕсли НазваниеСправочника = "Контрагенты" Тогда
		Выборка = Справочники.Контрагенты.Выбрать();
		ApplicationExcel.Sheets(1).Cells(1,5).Value = "Код";
		ApplicationExcel.Sheets(1).Cells(1,6).Value = "Наименование";
		ApplicationExcel.Sheets(1).Cells(1,7).Value = "ИНН";
		ApplicationExcel.Sheets(1).Cells(1,8).Value = "ПолноеЮридическоеНаименование";
		e = 5;
		f = 6;
		g = 7;
		h = 8;
	ИначеЕсли НазваниеСправочника = "Валюты" Тогда
		Выборка = Справочники.Валюты.Выбрать();
		ApplicationExcel.Sheets(1).Cells(1,10).Value = "Код";
		ApplicationExcel.Sheets(1).Cells(1,11).Value = "КодСимвольный";
		ApplicationExcel.Sheets(1).Cells(1,12).Value = "Наименование";
		k = 10;
		l = 11;
		m = 12;
	ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда	
		Выборка = Справочники.Сотрудники.Выбрать();
		ApplicationExcel.Sheets(1).Cells(1,14).Value = "Код";
		ApplicationExcel.Sheets(1).Cells(1,15).Value = "Наименование";
		ApplicationExcel.Sheets(1).Cells(1,16).Value = "Адрес";
		n = 14;
		p = 15;
		q = 16;
	КонецЕсли;
	
	i = 2;
	Пока Выборка.Следующий() Цикл
		Если НазваниеСправочника  = "Номенклатура" Тогда
			ApplicationExcel.Sheets(1).Cells(i,b).Value =Выборка.Код;
			ApplicationExcel.Sheets(1).Cells(i,c).Value = Выборка.Наименование;
			ApplicationExcel.Sheets(1).Cells(i,d).Value = Выборка.ВидТовара;
		ИначеЕсли  НазваниеСправочника = "Контрагенты" Тогда
			ApplicationExcel.Sheets(1).Cells(i,e).Value = Выборка.Код;
			ApplicationExcel.Sheets(1).Cells(i,f).Value = Выборка.Наименование;
			ApplicationExcel.Sheets(1).Cells(i,g).Value = Выборка.ИНН;
			ApplicationExcel.Sheets(1).Cells(i,h).Value = Выборка.ПолноеЮридическоеНаименование;
		ИначеЕсли НазваниеСправочника = "Валюты" Тогда	
			ApplicationExcel.Sheets(1).Cells(i,k).Value =  Выборка.Код;
			ApplicationExcel.Sheets(1).Cells(i,l).Value =  Выборка.КодСимвольный;
			ApplicationExcel.Sheets(1).Cells(i,m).Value =  Выборка.Наименование;
			
		ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда
			ApplicationExcel.Sheets(1).Cells(i,n).Value =  Выборка.Код;
			ApplicationExcel.Sheets(1).Cells(i,p).Value =  Выборка.Наименование;
			ApplicationExcel.Sheets(1).Cells(i,q).Value =  Выборка.Адрес;
		КонецЕсли;	
		i = i + 1;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере(ВыборСправочника,ПутьКФайлу);
КонецПроцедуры
&НаСервереБезКонтекста
Процедура ЗаписатьCSV(ТекстФайла, ИмяФайла)
	КодировкаФайла = КодировкаТекста.Системная;
	ТекстовыйФайлЗапись = Новый ЗаписьТекста(ИмяФайла,КодировкаФайла);
	ТекстовыйФайлЗапись.ЗаписатьСтроку(ТекстФайла);
	ТекстовыйФайлЗапись.Закрыть();
КонецПроцедуры	
&НаСервереБезКонтекста
Процедура ЗаписатьДанныеВФайлCSV(НазваниеСправочника,ПутьКФайлу)
	Если Не ЗначениеЗаполнено(ПутьКФайлу) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстФайлаCSV = "";
	СимволРазделителя = ";";
	
	Если НазваниеСправочника = "Номенклатура" Тогда
		ТекстФайлаCSV = "Код" + СимволРазделителя + "Наименование"+ СимволРазделителя + "ВидТовара"+Символы.ПС;
	ИначеЕсли НазваниеСправочника = "Контрагенты" Тогда
		ТекстФайлаCSV = "Код" + СимволРазделителя + "Наименование"+ СимволРазделителя + "ИНН"+СимволРазделителя+"ПолноеЮридическоеНаименование"+Символы.ПС;
	ИначеЕсли НазваниеСправочника = "Валюты" Тогда
		ТекстФайлаCSV = "Код" + СимволРазделителя + "КодСимвольный"+ СимволРазделителя + "Наименование"+Символы.ПС;
	ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда
		ТекстФайлаCSV = "Код" + СимволРазделителя + "Наименование"+ СимволРазделителя + "Адрес"+Символы.ПС;
	КонецЕсли;	
	
	Если НазваниеСправочника = "Номенклатура" Тогда
		Выборка = Справочники.Номенклатура.Выбрать();
	ИначеЕсли НазваниеСправочника = "Контрагенты" Тогда
		Выборка = Справочники.Контрагенты.Выбрать();
	ИначеЕсли НазваниеСправочника = "Валюты" Тогда
		Выборка = Справочники.Валюты.Выбрать();
	ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда	
		Выборка = Справочники.Сотрудники.Выбрать();
	КонецЕсли;
	
	
	Пока Выборка.Следующий() Цикл
		Если НазваниеСправочника  = "Номенклатура" Тогда
			ТекстФайлаCSV  = ТекстФайлаCSV +
			Выборка.Код +СимволРазделителя + Выборка.Наименование + Выборка.ВидТовара+Символы.ПС;
		ИначеЕсли  НазваниеСправочника = "Контрагенты" Тогда
			ТекстФайлаCSV  = ТекстФайлаCSV +
		    Выборка.Код +СимволРазделителя + Выборка.Наименование + СимволРазделителя + Выборка.ИНН + СимволРазделителя + Выборка.ПолноеЮридическоеНаименование+Символы.ПС;
		ИначеЕсли НазваниеСправочника = "Валюты" Тогда	
			ТекстФайлаCSV  =  ТекстФайлаCSV +
		    Выборка.Код +СимволРазделителя+Выборка.КодСимвольный + Выборка.Наименование + Символы.ПС;
		ИначеЕсли НазваниеСправочника = "Сотрудники" Тогда
			ТекстФайлаCSV  = ТекстФайлаCSV +
			Выборка.Код +СимволРазделителя + Выборка.Наименование + Выборка.Адрес+Символы.ПС;
		КонецЕсли;	
	КонецЦикла;	
	
		ЗаписатьCSV(ТекстФайлаCSV,ПутьКФайлу);

КонецПроцедуры	
&НаКлиенте
Процедура ВыгрузитьВCSV(Команда)
	ЗаписатьДанныеВФайлCSV(ВыборСправочника,ПутьКФайлу);
КонецПроцедуры
